Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ЗапланированныеРаботы
	Движения.ЗапланированныеРаботы.Записывать = Истина;
	Движение = Движения.ЗапланированныеРаботы.Добавить();
	Движение.РабочееМесто = РабочееМесто;
	Движение.ВремяНачала = ВремяНачала;
	Движение.ВремяОкончания = ВремяОкончания;
	Движение.Клиент = Клиент;
	Движение.Автомобиль = Автомобиль;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры