
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		РабочееМесто = ДанныеЗаполнения.РабочееМесто;
		ВремяНачала = ДанныеЗаполнения.ВремяНачала;
		ВремяОкончания = ДанныеЗаполнения.ВремяОкончания;
		Основание = ДанныеЗаполнения;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Комментарий = ДанныеЗаполнения.Комментарий;

		Для Каждого ТекСтрокаРаботы из ДанныеЗаполнения.Работы Цикл
			НоваяСтрока = Работы.Добавить();
			НоваяСтрока.Работа = ТекСтрокаРаботы.Работа;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
